In [ ]:
"""

Estudiantes:
Andrés Mauricio Acosta Pulido - 20142020111
Leidy Marcela Aldana Burgos - 20151020019
"""

In [1]:
import pandas as pd

In [3]:
dfnomina = pd.DataFrame({'SueldoParcial': ['5.000.000', '4.200.000', '12.000.000', '2.250.000','1.500.000'],'SueldoTotal': ['4.800.000', '4.000.000', '11.800.000', '2.050.000','1.200.000']},index=[0, 1, 2, 3, 4])
dfnomina

  SueldoParcial SueldoTotal
0     5.000.000   4.800.000
1     4.200.000   4.000.000
2    12.000.000  11.800.000
3     2.250.000   2.050.000
4     1.500.000   1.200.000

In [25]:
dfempleado = pd.DataFrame({'primerNombre': ['Andres', 'Leidy', 'Marcela', 'Mauricio','Teresa'],'SegundoNombre': ['Acosta', 'Pulido', 'Cuitiva', 'Aldana','Moreno'], 'Cedula': ['123','456','678','901','142'],'profesión':['Ingeniero','Administrador','Enfermera','Medica','Topografo']},index=[0, 1, 2, 3, 4])
dfempleado

  primerNombre SegundoNombre Cedula      profesión
0       Andres        Acosta    123      Ingeniero
1        Leidy        Pulido    456  Administrador
2      Marcela       Cuitiva    678      Enfermera
3     Mauricio        Aldana    901         Medica
4       Teresa        Moreno    142      Topografo

In [26]:
SueldoEmpleado=[dfnomina,dfempleado]
#SueldoEmpleado

In [31]:
dfv=pd.concat(SueldoEmpleado, axis=1, join_axes=[dfempleado.index])
dfv.filter

<bound method NDFrame.filter of   SueldoParcial SueldoTotal primerNombre SegundoNombre Cedula      profesión
0     5.000.000   4.800.000       Andres        Acosta    123      Ingeniero
1     4.200.000   4.000.000        Leidy        Pulido    456  Administrador
2    12.000.000  11.800.000      Marcela       Cuitiva    678      Enfermera
3     2.250.000   2.050.000     Mauricio        Aldana    901         Medica
4     1.500.000   1.200.000       Teresa        Moreno    142      Topografo>

# Ejemplo 2

In [18]:
# Cliente
df1 = pd.DataFrame({'NombreCliente': ['cl1', 'cl2'],'idProducto': ['0', '1']},index=[0, 1])
# Producto
df2 = pd.DataFrame({'NombreProducto': ['p1', 'p2']},index=[0, 1])
# Proceso
df3 = pd.DataFrame({'idCliente': ['0', '1'],'Alerta': ['0', '1']},index=[0, 1])
# Alerta
df4 = pd.DataFrame({'Descripcion': ['al1', 'al2']},index=[0, 1])
df4

  Descripcion
0         al1
1         al2